<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"9e8fdf85b7a7d7cfef2e0b6889c6fbec1af12269695fb6c2b9d89df385e994ce","plan_job_ref":"Job Plan Airflow DAGs #151 at https://github.com/cal-itp/data-infra/actions/runs/15937397433","plan_out_hash":"83d6df4a33c2c0f5d18fa123c54bff88232cee48b7ec62a4602bbf0bfc0ab50a","plan_hash":"72025a63f1638c080ceb908fb9c919f8dec6d50bf16d9aa41995068710caefc4","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 11 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp--composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp--composer-partial_parse" {
        id                  = "us-west2-calitp-airflow2-pr-f6bb9855-bucket-data/warehouse/target/partial_parse.msgpack"
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (20 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/cosmos_payment_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "K+YDLg==" -> (known after apply)
!~      detect_md5hash      = "Cw99qTY9/Dfp+wTpsAFhHQ==" -> "different hash"
!~      generation          = 1750998730575118 -> (known after apply)
        id                  = "us-west2-calitp-airflow2-pr-f6bb9855-bucket-dags/cosmos_payment_dag.py"
!~      md5hash             = "Cw99qTY9/Dfp+wTpsAFhHQ==" -> (known after apply)
        name                = "dags/cosmos_payment_dag.py"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "Wj3k0Q==" -> (known after apply)
!~      detect_md5hash      = "D00WqjAOVYTZtwgh6ae5Eg==" -> "different hash"
!~      generation          = 1750998729146303 -> (known after apply)
        id                  = "us-west2-calitp-airflow2-pr-f6bb9855-bucket-dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"
!~      md5hash             = "D00WqjAOVYTZtwgh6ae5Eg==" -> (known after apply)
        name                = "dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "EdsP8w==" -> (known after apply)
!~      detect_md5hash      = "RkFCvz17Ob0uAV3XwTuDiw==" -> "different hash"
!~      generation          = 1750998728889831 -> (known after apply)
        id                  = "us-west2-calitp-airflow2-pr-f6bb9855-bucket-dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"
!~      md5hash             = "RkFCvz17Ob0uAV3XwTuDiw==" -> (known after apply)
        name                = "dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse/dbt_test.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "wlePkA==" -> (known after apply)
!~      detect_md5hash      = "t+44nhARoCJF4rVEvR5jxQ==" -> "different hash"
!~      generation          = 1750998729841778 -> (known after apply)
        id                  = "us-west2-calitp-airflow2-pr-f6bb9855-bucket-dags/transform_warehouse/dbt_test.yml"
!~      md5hash             = "t+44nhARoCJF4rVEvR5jxQ==" -> (known after apply)
        name                = "dags/transform_warehouse/dbt_test.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "uMW8eg==" -> (known after apply)
!~      detect_md5hash      = "yc9BKIVWCufrnqBGHtJ+zQ==" -> "different hash"
!~      generation          = 1750998770594474 -> (known after apply)
        id                  = "us-west2-calitp-airflow2-pr-f6bb9855-bucket-dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"
!~      md5hash             = "yc9BKIVWCufrnqBGHtJ+zQ==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse_full_refresh/dbt_test.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "+DVZBg==" -> (known after apply)
!~      detect_md5hash      = "uB4KDMyLm8X67b0SdoCz8Q==" -> "different hash"
!~      generation          = 1750998741805209 -> (known after apply)
        id                  = "us-west2-calitp-airflow2-pr-f6bb9855-bucket-dags/transform_warehouse_full_refresh/dbt_test.yml"
!~      md5hash             = "uB4KDMyLm8X67b0SdoCz8Q==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh/dbt_test.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "qOCVbg==" -> (known after apply)
!~      detect_md5hash      = "C3LAbREGVADYwRVIU7f60A==" -> "different hash"
!~      generation          = 1750998733054982 -> (known after apply)
        id                  = "us-west2-calitp-airflow2-pr-f6bb9855-bucket-dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"
!~      md5hash             = "C3LAbREGVADYwRVIU7f60A==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "u99dqA==" -> (known after apply)
!~      detect_md5hash      = "XQiR+2TSAH95+/w9FPSihg==" -> "different hash"
!~      generation          = 1750998727830896 -> (known after apply)
        id                  = "us-west2-calitp-airflow2-pr-f6bb9855-bucket-dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"
!~      md5hash             = "XQiR+2TSAH95+/w9FPSihg==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "G8NXDQ==" -> (known after apply)
!~      detect_md5hash      = "7F/5T64pEAx/osXlB9MbDA==" -> "different hash"
!~      generation          = 1750998742424890 -> (known after apply)
        id                  = "us-west2-calitp-airflow2-pr-f6bb9855-bucket-dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"
!~      md5hash             = "7F/5T64pEAx/osXlB9MbDA==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "3xUlyw==" -> (known after apply)
!~      detect_md5hash      = "zMPuOjgI6EQwPHTTIdlz9w==" -> "different hash"
!~      generation          = 1750998724786626 -> (known after apply)
        id                  = "us-west2-calitp-airflow2-pr-f6bb9855-bucket-dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"
!~      md5hash             = "zMPuOjgI6EQwPHTTIdlz9w==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 11 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #151](https://github.com/cal-itp/data-infra/actions/runs/15937397433)